<?php

$bots=array(
    3=>11111, 4=>11112, 5=>11113, 6=>11114, 7=>11115, 8=>11116, 9=>11135, 10=>11133, 11=>11141, 12=>11142, 
    13=>11143, 14=>11144, 15=>11145, 16=>11146, 17=>11147, 18=>11148, 19=>11149, 20=>11150, 21=>11151, 
    22=>11152, 23=>19581, 24=>19586, 25=>19587, 26=>19593, 27=>19910, 28=>20444, 29=>20447, 30=>20448,
    31=>20450, 32=>20451, 33=>20452, 34=>20453, 35=>20460, 36=>20465, 37=>20468, 38=>20471, 39=>20472,
    40=>20476, 41=>20667, 42=>20720, 43=>20722, 44=>20723, 45=>20725, 46=>20726, 47=>20727, 48=>20728, 
    49=>20759, 50=>3946, 51=>20760, 52=>20761, 53=>20762, 54=>20764, 55=>21042, 56=>21043, 57=>21044, 58=>21045,
    59=>21047, 60=>21048, 61=>21049, 62=>21050, 63=>21051,
    64=>21052, 65=>21053, 66=>21054, 67=>21055, 68=>21056,
    69=>21057, 70=>21058, 71=>21059, 72=>21060, 73=>21061, 74=>21062,
    75=>21299, 76=>21300, 77=>21302, 78=>21303, 79=>21304, 80=>21305,
    81=>21450, 82=>21451, 83=>21452, 84=>21453, 85=>21454, 86=>21455, 87=>21456, 88=>21970, 89=>21971
    
);

$botnames=array(
    3=>"Обезьяноподобный", // 11111
    4=>"Зеленоглазый",  // 11112  
    5=>"Ящер", // 11113
    6=>"Тварь Рогатая", // 11114
    7=>"Зеброкот", // 11115
    8=>"Головастик", // 11116
    9=>"Страж подгорья", // 11135
    10=>"Цверг", // 11133
    11=>"Смотритель мглы", // 11141 [8] // HR350/50/50/30/30
    12=>"Сторож мглы", // 11142 [8] // HR700/50/20/35/40/20
    13=>"Рабочий мглы", // 11143 [7] // HR450/50/25/20/30
    14=>"Литейщик", // 11144 [7] // HR450/50/25/20/30          ////////////////// 74 , 83
    15=>"Надзиратель глубин", // 11145 [8] // HR375/40/50/35/30  ////////////////// 74 , 83
    16=>"Офицер глубин", // 11146 [8]
    17=>"Наххр", // 11147 [8]
    18=>"Служитель глубин", // 11148 [8] // HP500/30/30/50/30 ////////////////// 74 , 83
    19=>"Рубака глубин", // 11149 [8] // HR500/30/25/50/30 // В БД login 1-ая буква P латинская  ////////////////// 74 , 83
    20=>"Берсерк", // 11150 [9]
    21=>"Слизь", // 11151 [8] // HR500/53/20/50/30 // В БД login 1-ая буква C латинская
    22=>"Зубастая слизь", // 11152 [8]
    23=>"Сторож мглы", // 19581 [8] // HR800/80/3/3/40 // В БД login 1-ая буква C латинская
    24=>"Рабочий мглы", // 19586 [9] // HR500/30/30/50/30 // В БД login 1-ая буква P латинская
    25=>"Надзиратель глубин", // 19587 [9] // HR600/50/50/20/30/10 // В БД login 1-ая буква А латинская  ////////////////// 74 , 83
    26=>"Литейщик", // 19593 [8] // HR500/30/30/50/30 // В БД login первая 1-ая E латинская    ////////////////// 74 , 83
    27=>"Рабочий мглы", // 19910 [9] // HR1000/50/20/35/40/20 // В БД login 1-ая буква А латинская
    28=>"Слизь", // 20444 [9] // HR700/55/30/55/30 // В БД login 1-ая буква C латинская, в конце "."
    29=>"Смотритель мглы", // 20447 [9] // HR600/50/70/15/30 // В БД login 1-ая буква C латинская
    30=>"Хищная Слизь", // 20448 [9] // HR1500/50/35/60/30
    31=>"Рабочий мглы", // 20450 [9] // HR3000/50/15/15/50 // В БД login 1-ая буква O латинская
    32=>"Рабочий мглы", // 20451 [9] // HR6000/50/15/15/50 // В БД login 1-ые буквы Pa латинские
    33=>"Сторож мглы", // 20452 [8] // HR1600/80/3/3/40 // В БД login 1-ая буква O латинская
    34=>"Чернокнижник", // 20453 [9]
    35=>"Рубака глубин", // 20460 [9] // HR650/50/15/60/30/5 // В БД login 1-ая буква A латинская   ////////////////// 74 , 83
    36=>"Служитель глубин", // 20465 [9] // HP750/50/15/15/50 // В БД login 1-ая буква C латинская  ////////////////// 74
    37=>"Служитель глубин", // 20468 [9] // HP1500/50/15/15/50 // В БД login 1-ая буква Y латинская
    38=>"Страж глубин", // 20471 [9] // HP1700/75/25/25/55/10 
    39=>"Страж глубин", // 20472 [9] // HP3400/75/25/25/55/10 // В БД login 1-ая буква C латинская
    40=>"Епископ", // 20476 [9]
    41=>"Слуга Валентая", // 20667
    42=>"Проклятый", // 20720 [10] // HP1000
    43=>"Зомби", // 20722 [10] // HP1800 // В БД login 1-ая буква O латинская
    44=>"Зомби", // 20723 [10] // HP2160 // В БД login 1-ая буква O латинская и в конце "."
    45=>"Пожиратель Падали", // 20725 [10]
    46=>"Шут Повелителя", // 20726 [10]
    47=>"Трупожор", // 20727 [10]
    48=>"Проклятый Пленник", // 20728 [10]
    49=>"Проклятый", // 20759 // HP1100 [10]
    50=>"Отморозок", // 3946
    51=>"Древний Страж", // 20760 // HP8000 [10]
    52=>"Древний Страж", // 20761 // HP8800 [10]
    53=>"Повелитель", // 20762
    54=>"Древний Страж", //20764 // HP10400
    /////////////// Потеряный вход ///////////////////////////////////////
    55=>"Память Кроггентайла", // HP2500/40 // 21042 
    56=>"Память Кроггентайла", // HP5000    // 21043 // в Кроггентайла латинская K 
    57=>"Память Кроггентайла", // HP2000    // 21044  // в Кроггентайла латинская p
    58=>"Память Кроггентайла", // HP2500/60 // 21045 // в Кроггентайла латинская o
    59=>"Боль Кроггентайла", // HP750  // 21047
    60=>"Боль Кроггентайла", // HP1800 // 21048 // в Кроггентайла латинская K
    61=>"Боль Кроггентайла", // HP3600 // 21049 // в Кроггентайла латинская p
    62=>"Боль Кроггентайла", // HP3000 // 21050 // в Кроггентайла латинская o
    63=>"Боль Кроггентайла", // HP4000 // 21051 // в Кроггентайла латинская e
    64=>"Сила Кроггентайла", // HP1200  // 21052
    65=>"Сила Кроггентайла", // HP1500 // 21053 // в Кроггентайла латинская K
    66=>"Сила Кроггентайла", // HP3000 // 21054 // в Кроггентайла латинская p
    67=>"Сила Кроггентайла", // HP1800 // 21055 // в Кроггентайла латинская o
    68=>"Сила Кроггентайла", // HP2400 // 21056 // в Кроггентайла латинская e
    69=>"Душа Кроггентайла", // HP950  // 21057
    70=>"Душа Кроггентайла", // HP1150 // 21058 // в Кроггентайла латинская K 
    71=>"Душа Кроггентайла", // HP2300 // 21059 // в Кроггентайла латинская p
    72=>"Душа Кроггентайла", // HP1350 // 21060 // в Кроггентайла латинская o
    73=>"Душа Кроггентайла", // HP1800 // 21061 // в Кроггентайла латинская e
    74=>"Король Валлуар",
    /////////////// Сторожевая башня ///////////////////////////////////////
    75=>"Kровавый Сантехник", // 21299
    76=>"Kровавый Сантехник. Командир", // 21300
    77=>"Пpоклятие Глубин", // 21302
    78=>"Пpоклятие Глубин. Командир", // 21303
    79=>"Душа Кроггентaйла", // 21304 // в Кроггентайла латинская a
    80=>"Душа Кроггентайла. Командир", // 21305
    /////////////// Бездна ///////////////////////////////////////
    81=>"Страж Дайтон", // 21450
    82=>"Cлужитель Бездны", // 21451 // В БД login 1-ая буква c латинская
    83=>"Прoклятие Глубин", // 21452 // В БД login 1-ая буква o латинская
    84=>"Ольгерт Вирт", // 21453
    85=>"Большой Тяжёлый Молот", // 21454
    86=>"Гарл Йонни Салистон", // 21455
    87=>"Kошмар Глубин", // 21456 // В БД login 1-ая буква k латинская
    88=>"Шпион", // 21970 [8] // HR500/30/30/50/30 // В БД login первая 1-ая E латинская 
    89=>"Вождь Бездны", // 21971 // В БД login 1-ая буква c латинская
);

?>
